{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00ca\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "name": "lambda_1", "input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 70, 320, 3], "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_row": 5, "nb_filter": 32, "bias": true, "activation": "linear", "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "subsample": [2, 2], "dim_ordering": "tf", "b_regularizer": null, "border_mode": "same", "nb_col": 5, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_row": 3, "nb_filter": 16, "bias": true, "activation": "linear", "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "subsample": [1, 1], "dim_ordering": "tf", "b_regularizer": null, "border_mode": "same", "nb_col": 3, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "name": "maxpooling2d_2", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_row": 3, "nb_filter": 16, "bias": true, "activation": "linear", "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "subsample": [1, 1], "dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "nb_col": 3, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.3}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "b_constraint": null, "input_dim": 3648, "b_regularizer": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "activation": "linear", "output_dim": 512, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.3}}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "b_constraint": null, "input_dim": 512, "b_regularizer": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "activation": "linear", "output_dim": 256, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "b_constraint": null, "input_dim": 256, "b_regularizer": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "activation": "linear", "output_dim": 1, "init": "glorot_uniform", "W_constraint": null}}]}