{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "input_dtype": "float32", "output_shape": null, "arguments": {}, "batch_input_shape": [null, 70, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00ca\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "output_shape_type": "raw", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "init": "glorot_uniform", "activation": "linear", "trainable": true, "dim_ordering": "tf", "nb_filter": 32, "bias": true, "W_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "nb_col": 5, "W_regularizer": null, "nb_row": 5, "b_constraint": null, "subsample": [1, 1], "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "init": "glorot_uniform", "activation": "linear", "trainable": true, "dim_ordering": "tf", "nb_filter": 16, "bias": true, "W_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "nb_row": 3, "b_constraint": null, "subsample": [1, 1], "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "init": "glorot_uniform", "activation": "linear", "trainable": true, "dim_ordering": "tf", "nb_filter": 16, "bias": true, "W_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "nb_row": 3, "b_constraint": null, "subsample": [1, 1], "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.3, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 18720, "init": "glorot_uniform", "activation": "linear", "trainable": true, "bias": true, "W_constraint": null, "name": "dense_1", "activity_regularizer": null, "output_dim": 512, "W_regularizer": null, "b_constraint": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.3, "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 512, "init": "glorot_uniform", "activation": "linear", "trainable": true, "bias": true, "W_constraint": null, "name": "dense_2", "activity_regularizer": null, "output_dim": 256, "W_regularizer": null, "b_constraint": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 256, "init": "glorot_uniform", "activation": "linear", "trainable": true, "bias": true, "W_constraint": null, "name": "dense_3", "activity_regularizer": null, "output_dim": 1, "W_regularizer": null, "b_constraint": null, "b_regularizer": null}}], "keras_version": "1.2.1"}